
&НаСервере
Процедура ЗаполнитьОчередьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	dev_Контрагенты.Ссылка КАК Контрагент
	               |ИЗ
	               |	Справочник.dev_Контрагенты КАК dev_Контрагенты";
	
	Набор = РегистрыСведений.dev_ОчередьНормализацииАдресовКонтрагентов.СоздатьНаборЗаписей();
	Т = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Т Цикл
		НоваяСтрока = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор;
	КонецЦикла;
	
	Попытка
		Набор.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОчередь(Команда)
	
	ЗаполнитьОчередьНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
